# St7GetTotalCavityFluidLayouts

Returns the total number and highest ID number of the cavity fluid layouts in the specified model.

long St7GetTotalCavityFluidLayouts(long uID, long* NumLayouts, long* LastLayout)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumLayouts

The number of layouts.

LastLayout

The highest layout ID.